// 時刻表の値を配列に格納
// 時刻表に変更があった場合ここを変える
var i = 0;
list2 = new Array(28);
list2[0] = 550; //60*9+10
list2[1] = 565; //60*9+25
list2[2] = 580; //60*9+40
list2[3] = 600; //60*10+00
list2[4] = 610; //60*10+10
list2[5] = 645; //60*10+45
list2[6] = 660; //60*11+0
list2[7] = 745; //60*12+25
list2[8] = 760; //60*12+40
list2[9] = 825; //60*13+45
list2[10] = 845; //60*14+05
list2[11] = 865; //60*14+25
list2[12] = 890; //60*14+50
list2[13] = 905; //60*15+05
list2[14] = 925; //60*15+25
list2[15] = 945; //60*15+45
list2[16] = 965; //60*16+05
list2[17] = 985; //60*16+25
list2[18] = 1005; //60*16+45
list2[19] = 1025; //60*17+05
list2[20] = 1035; //60*17+15
list2[21] = 1055; //60*17+35
list2[22] = 1065; //60*17+45
list2[23] = 1100; //60*18+20
list2[24] = 1130; //60*18+50
list2[25] = 1160; //60*19+20
list2[26] = 1235; //60*20+35
list2[27] = 1270; //60*21+10

if(week=='1'||week=='4')// 運行ありまたは休みならば
max = 27;
else// 臨時便
max = 22;

start = list2[0]-30;// カウントダウン開始時間　始発の30分前
end = list2[max];// 最終便の時間

ac_time = new Date();// 現在の時間を所得

// 現在の時間から時刻表の開始時間を調べる
for(i=0;list2[i]<=60*ac_time.getHours()+ac_time.getMinutes()&&i<=max;i++){}
if(i>max){//最終便が出ていたら
	i=0;
	ac_time.setTime(ac_time.getTime()+24*60*60*1000);//明日
}

// 時刻表の値を設定
ac_time.setHours(list2[i]/60);
ac_time.setMinutes(list2[i]%60);
ac_time.setSeconds(0);
ac_time.setMilliseconds(0);