// 時刻表の値を配列に格納
// 時刻表に変更があった場合ここを変える
var i = 0;

list1 = new Array(29);
list1[0] = 479; //60*7+59
list1[1] = 490; //60*8+10
list1[2] = 505; //60*8+25
list1[3] = 520; //60*8+40
list1[4] = 535; //60*8+55
list1[5] = 550; //60*9+10
list1[6] = 565; //60*9+25
list1[7] = 580; //60*9+40
list1[8] = 595; //60*9+55
list1[9] = 615; //60*10+15
list1[10] = 625; //60*10+25
list1[11] = 660; //60*11+00
list1[12] = 675; //60*11+15
list1[13] = 700; //60*11+40
list1[14] = 760; //60*12+40
list1[15] = 775; //60*12+55
list1[16] = 800; //60*13+20
list1[17] = 820; //60*13+40
list1[18] = 840; //60*14+00
list1[19] = 860; //60*14+20
list1[20] = 880; //60*14+40
list1[21] = 900; //60*15+00
list1[22] = 940; //60*15+40
list1[23] = 1000; //60*16+40
list1[24] = 1020; //60*17+00
list1[25] = 1050; //60*17+30
list1[26] = 1145; //60*19+05
list1[27] = 1175; //60*19+35
list1[28] = 1250; //60*20+50

if(week=='1')// 運行ありまたは休みならば
max = 28;
else// 臨時便
max = 24;

start = list1[0]-30;// カウントダウン開始時間　始発の30分前
end = list1[max];// 最終便の時間

sta_time = new Date();// 現在の時間を所得

// 現在の時間から時刻表の開始時間を調べる
for(i=0;list1[i]<=60*sta_time.getHours()+sta_time.getMinutes()&&i<=max;i++){}
if(i>max){//最終便が出ていたら
	i=0;
	sta_time.setTime(sta_time.getTime()+24*60*60*1000);
}

// 時刻表の値を設定
sta_time.setHours(list1[i]/60);
sta_time.setMinutes(list1[i]%60);
sta_time.setSeconds(0);
sta_time.setMilliseconds(0);